tanishqsngl/STM32f103/DitchDescent1/src/main.c
	//Actuator Pins
	GPIOC -> CRH |= (GPIO_CRH_MODE13_0);
	GPIOC -> CRH &= ~(GPIO_CRH_MODE13_1);
	GPIOC -> CRH |= GPIO_CRH_MODE14_0;
	GPIOC -> CRH &= ~(GPIO_CRH_MODE14_1);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF13_0);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF13_1);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF14_0);
	GPIOC -> CRH &= ~(GPIO_CRH_CNF14_1);

	//Pitch Pins
	GPIOA -> CRL |= (GPIO_CRL_MODE4_0);
	GPIOA -> CRL &= ~(GPIO_CRL_MODE4_1);
	GPIOA -> CRL |= GPIO_CRL_MODE5_0;
	GPIOA -> CRL &= ~(GPIO_CRL_MODE5_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF4_0);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF4_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF5_0);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF5_1);

	//Roll Pins
	GPIOA -> CRL |= (GPIO_CRL_MODE6_0);
	GPIOA -> CRL &= ~(GPIO_CRL_MODE6_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF6_0);
	GPIOA -> CRL |= GPIO_CRL_CNF6_1;
	GPIOA -> CRL |= GPIO_CRL_MODE7_0;
	GPIOA -> CRL &= ~(GPIO_CRL_MODE7_1);
	GPIOA -> CRL &= ~(GPIO_CRL_CNF7_0);
	GPIOA -> CRL |= GPIO_CRL_CNF7_1;

	//Gripper Pins
	GPIOA -> CRH |= (GPIO_CRH_MODE11_0);
	GPIOA -> CRH &= ~(GPIO_CRH_MODE11_1);
	GPIOA -> CRH |= GPIO_CRH_MODE12_0;
	GPIOA -> CRH &= ~(GPIO_CRH_MODE12_1);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF11_0);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF11_1);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF12_0);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF12_1);

	//Swivel Base Pins
	GPIOB -> CRH |= (GPIO_CRH_MODE14_0);
	GPIOB -> CRH &= ~(GPIO_CRH_MODE14_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF14_0);
	GPIOB -> CRH |= GPIO_CRH_CNF14_1;
	GPIOB -> CRH |= GPIO_CRH_MODE15_0;
	GPIOB -> CRH &= ~(GPIO_CRH_MODE15_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF15_0);
	GPIOB -> CRH |= GPIO_CRH_CNF15_1;

	//Wheel Motor Pins
	GPIOB -> CRL |= (GPIO_CRL_MODE0_0);
	GPIOB -> CRL |= GPIO_CRL_MODE0_1;
	GPIOB -> CRH |= GPIO_CRH_MODE10_0;
	GPIOB -> CRH |= (GPIO_CRH_MODE10_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF0_0);
	GPIOB -> CRL |= GPIO_CRL_CNF0_1;
	GPIOB -> CRH &= ~(GPIO_CRH_CNF10_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF10_1);
	GPIOB -> CRL |= GPIO_CRL_MODE1_0;
	GPIOB -> CRL |= (GPIO_CRL_MODE1_1);
	GPIOB -> CRH |= GPIO_CRH_MODE11_0;
	GPIOB -> CRH |= (GPIO_CRH_MODE11_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF1_0);
	GPIOB -> CRL |= GPIO_CRL_CNF1_1;
	GPIOB -> CRH &= ~(GPIO_CRH_CNF11_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF11_1);

	//Camera A8 B56789
	GPIOA -> CRH |= (GPIO_CRH_MODE8_0);
	GPIOA -> CRH &= ~(GPIO_CRH_MODE8_1);
	GPIOB -> CRL |= GPIO_CRL_MODE5_0;
	GPIOB -> CRL &= ~(GPIO_CRL_MODE5_1);
	GPIOB -> CRL |= GPIO_CRL_MODE6_0;
	GPIOB -> CRL &= ~(GPIO_CRL_MODE6_1);
	GPIOB -> CRL |= GPIO_CRL_MODE7_0;
	GPIOB -> CRL &= ~(GPIO_CRL_MODE7_1);
	GPIOB -> CRH |= GPIO_CRH_MODE8_0;
	GPIOB -> CRH &= ~(GPIO_CRH_MODE8_1);
	GPIOB -> CRH |= GPIO_CRH_MODE9_0;
	GPIOB -> CRH &= ~(GPIO_CRH_MODE9_1);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF8_0);
	GPIOA -> CRH &= ~(GPIO_CRH_CNF8_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF5_0);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF5_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF6_0);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF6_1);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF7_0);
	GPIOB -> CRL &= ~(GPIO_CRL_CNF7_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF8_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF8_1);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF9_0);
	GPIOB -> CRH &= ~(GPIO_CRH_CNF9_1);
}

void UARTSetup(void)
{
	//UART
	USART1 -> CR1 |= USART_CR1_UE;
	USART1 -> BRR = 0x271;//EA6(9600 36) 271(57600 36) 4E2(57600 72) 753(38400 72)
	USART1 -> CR1 &= ~(USART_CR1_M);//8 data bits
	USART1 -> CR1 |= USART_CR1_RXNEIE;
	USART1 -> CR1 |= USART_CR1_IDLEIE;
	USART1 -> CR3 &= ~(USART_CR3_RTSE);
}

void UART2Setup(void)
{
	//UART2
	USART2 -> CR1 |= USART_CR1_UE;
	USART2 -> BRR = 0x271;//EA6(9600 36) 271(57600 36) 4E2(57600 72) 753(38400 72)
	USART2 -> CR1 &= ~(USART_CR1_M);//8 data bits
	USART2 -> CR1 |= USART_CR1_RXNEIE;
	USART2 -> CR1 |= USART_CR1_IDLEIE;
	USART2 -> CR3 &= ~(USART_CR3_RTSE);
}

void DCServoF(uint32_t aDelay)
{
	GPIOA -> BSRR |= GPIO_BSRR_BS0;
	GPIOA -> BSRR |= GPIO_BSRR_BR1;
	GPIOA -> BSRR |= GPIO_BSRR_BR2;
	GPIOC -> BSRR |= GPIO_BSRR_BR15;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BR0;
	GPIOA -> BSRR |= GPIO_BSRR_BR1;
	GPIOA -> BSRR |= GPIO_BSRR_BS2;
	GPIOC -> BSRR |= GPIO_BSRR_BR15;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BR0;
	GPIOA -> BSRR |= GPIO_BSRR_BS1;
	GPIOA -> BSRR |= GPIO_BSRR_BR2;
	GPIOC -> BSRR |= GPIO_BSRR_BR15;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BR0;
	GPIOA -> BSRR |= GPIO_BSRR_BR1;
	GPIOA -> BSRR |= GPIO_BSRR_BR2;
	GPIOC -> BSRR |= GPIO_BSRR_BS15;

	Delay(aDelay);
}

void DCServoB(uint32_t aDelay)
{
	GPIOA -> BSRR |= GPIO_BSRR_BS0;
	GPIOA -> BSRR |= GPIO_BSRR_BS1;
	GPIOA -> BSRR |= GPIO_BSRR_BS2;
	GPIOC -> BSRR |= GPIO_BSRR_BR15;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BS0;
	GPIOA -> BSRR |= GPIO_BSRR_BR1;
	GPIOA -> BSRR |= GPIO_BSRR_BS2;
	GPIOC -> BSRR |= GPIO_BSRR_BS15;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BS0;
	GPIOA -> BSRR |= GPIO_BSRR_BS1;
	GPIOA -> BSRR |= GPIO_BSRR_BR2;
	GPIOC -> BSRR |= GPIO_BSRR_BS15;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BR0;
	GPIOA -> BSRR |= GPIO_BSRR_BS1;
	GPIOA -> BSRR |= GPIO_BSRR_BS2;
	GPIOC -> BSRR |= GPIO_BSRR_BS15;

	Delay(aDelay);
}

void DCServoF1(uint32_t aDelay)
{
	GPIOA -> BSRR |= GPIO_BSRR_BS8;
	GPIOB -> BSRR |= GPIO_BSRR_BR5;
	GPIOB -> BSRR |= GPIO_BSRR_BR6;
	GPIOB -> BSRR |= GPIO_BSRR_BR7;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BR8;
	GPIOB -> BSRR |= GPIO_BSRR_BR5;
	GPIOB -> BSRR |= GPIO_BSRR_BS6;
	GPIOB -> BSRR |= GPIO_BSRR_BR7;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BR8;
	GPIOB -> BSRR |= GPIO_BSRR_BS5;
	GPIOB -> BSRR |= GPIO_BSRR_BR6;
	GPIOB -> BSRR |= GPIO_BSRR_BR7;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BR8;
	GPIOB -> BSRR |= GPIO_BSRR_BR5;
	GPIOB -> BSRR |= GPIO_BSRR_BR6;
	GPIOB -> BSRR |= GPIO_BSRR_BS7;

	Delay(aDelay);
}

void DCServoB1(uint32_t aDelay)
{
	GPIOA -> BSRR |= GPIO_BSRR_BS8;
	GPIOB -> BSRR |= GPIO_BSRR_BS5;
	GPIOB -> BSRR |= GPIO_BSRR_BS6;
	GPIOB -> BSRR |= GPIO_BSRR_BR7;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BS8;
	GPIOB -> BSRR |= GPIO_BSRR_BR5;
	GPIOB -> BSRR |= GPIO_BSRR_BS6;
	GPIOB -> BSRR |= GPIO_BSRR_BS7;

	Delay(aDelay);

	GPIOA -> BSRR |= GPIO_BSRR_BS8;
	GPIOB -> BSRR |= GPIO_BSRR_BS5;
	GPIOB -> BSRR |= GPIO_BSRR_BR6;
	GPIOB -> BSRR |= GPIO_BSRR_BS7;

