tanishqsngl/STM32f103/DitchDescent1/src/main.c
void RoboticArm(uint32_t A)
{
	uint16_t sBase = 0;
	uint16_t sBase1 = 0;
	uint32_t roll = 0;
	uint32_t roll1 = 0;
	uint16_t servoD = 0;
	uint16_t servoD1 = 0;
	uint16_t servoD2 = 0;
	uint16_t servoD21 = 0;

	if(A=='s' || A=='S')//s or S Swivel Base
	{
		for(int i=0;i<4;i++)
		{
			emStop();
			sBase = sBase - 48;
			sBase1 = sBase1*10 + sBase;
		}

			//Main code for swivel base
			TIM1 -> CR1 |= TIM_CR1_CEN;
			TIM1 -> CCER |= TIM_CCER_CC3NE;
			TIM1 -> CCER |= TIM_CCER_CC2NE;

			TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_2;
			TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_1;
			TIM1 -> CCMR2 |= TIM_CCMR2_OC3M_0;
			TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_2;
			TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_1;
			TIM1 -> CCMR1 |= TIM_CCMR1_OC2M_0;

			for(int i=0;i<2;i++)
			{
				emStop();
				sBase = USART1-> DR;
				sBase = sBase - 48;
				sBase1 = sBase1*10 + sBase;
			}

			sBase1 = sBase1-12;
			sBase1 = sBase1*1260;

			if(A=='s')//s forward
			{
				TIM1 -> CCR2 = sBase1;
				GPIOB -> BSRR |= GPIO_BSRR_BR15;

			}
			else if(A=='S')//S backward
			{
				TIM1 -> CCR2 = sBase1;
				GPIOB -> BSRR |= GPIO_BSRR_BS15;
			}
		}

	if(A=='t' || A=='T')//DC Servo
	{
		for(int i=0;i<2;i++)
		{
			emStop();
			servoD = USART1 -> DR;
			servoD = servoD-48;
			servoD1 = servoD1*10 + servoD;
		}

		servoD1 = servoD1-12;

		if(A=='t')//t
		{
			//DC Servo forward A0 A1 A2 C15
			DCServoF(servoD1);
		}

		else if(A=='T')//T
		{
			//DC Servo backward
			DCServoB(servoD1);
		}
	}

	if(A=='o' || A=='O')//DC Servo
	{
		for(int i=0;i<2;i++)
		{
			emStop();
			servoD2 = USART1 -> DR;
			servoD2 = servoD2 - 48;
			servoD21 = servoD21*10 + servoD2;
		}

		servoD21 = servoD21-12;
		//servoD1 = servoD1;

		if(A=='o')//o
		{
			//DC Servo forward A8 B5 B6 B7
			DCServoF1(servoD21);
		}

		else if(A=='O')//O
		{
			//DC Servo backward
			DCServoB1(servoD21);
		}
	}

	if(A=='b' || A=='B')//B b actuator
	{
		if(A=='b')//b forward
		{
			GPIOC -> BSRR |= GPIO_BSRR_BS13;
			GPIOC -> BSRR |= GPIO_BSRR_BR14;
		}
		else if(A=='B')//B backward
		{
			GPIOC -> BSRR |= GPIO_BSRR_BS13;
			GPIOC -> BSRR |= GPIO_BSRR_BS14;
		}
	}

	if(A=='p' || A=='P')//Pitch p and P
	{
		if(A=='p')//forward
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS4;
			GPIOA -> BSRR |= GPIO_BSRR_BR5;
		}

		else if(A=='P')//Backward
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS4;
			GPIOA -> BSRR |= GPIO_BSRR_BS5;
		}
	}

	if(A=='g' || A=='G')//Roll q and Q
	{
		TIM3 -> CR1 |= TIM_CR1_CEN;
		TIM3 -> CCER |= TIM_CCER_CC1E;
		TIM3 -> CCER |= TIM_CCER_CC2E;

		TIM3 -> CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC1M_0;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_2;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_1;
		TIM3 -> CCMR1 |= TIM_CCMR1_OC2M_0;

		for(int i=0;i<2;i++)
		{
			emStop();
			roll = USART1-> DR;
			roll = roll - 48;
			roll1 = roll1*10 + roll;
		}

		roll1 = roll1 - 12;
		roll1 = roll1*1260;

		if(A=='g')//q forward
		{
			TIM3 -> CCR1 = 0;
			TIM3 -> CCR2 = roll1;
		}
		else if(A=='G')//G backward
		{
			TIM3 -> CCR1 = 32768;
			TIM3 -> CCR2 = roll1;
		}
	}

	if(A=='q' || A=='Q')//Gripper G g
	{
		if(A=='q')//forward g
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS11;
			GPIOA -> BSRR |= GPIO_BSRR_BR12;
		}
		else if(A=='Q')//Backward G
		{
			GPIOA -> BSRR |= GPIO_BSRR_BS11;
			GPIOA -> BSRR |= GPIO_BSRR_BS12;
		}
	}
	else if(A=='c')
	{
		TIM3 -> CCR4 = 0;//FL
		TIM3 -> CCR3 = 0;//FR
		stopArm();
	}
	sBase = 0;
	sBase1 = 0;
	roll = 0;
	roll1 = 0;
	servoD = 0;
	servoD1 = 0;
	servoD2 = 0;
	servoD21 = 0;
}


int main()
{
	RCC -> APB2ENR |= RCC_APB2ENR_IOPAEN;
	RCC -> APB2ENR |= RCC_APB2ENR_IOPBEN;
	RCC -> APB2ENR |= RCC_APB2ENR_IOPCEN;
	RCC -> APB2ENR |= RCC_APB2ENR_USART1EN;
	RCC -> APB1ENR |= RCC_APB1ENR_USART2EN;
	RCC -> APB2ENR |= RCC_APB2ENR_AFIOEN;
	RCC -> CFGR &= ~(RCC_CFGR_PPRE2_0);
	RCC -> CFGR &= ~(RCC_CFGR_PPRE2_1);
	RCC -> CFGR |= RCC_CFGR_PPRE2_2;
	RCC -> APB1ENR |= RCC_APB1ENR_TIM2EN;
	RCC -> APB1ENR |= RCC_APB1ENR_TIM3EN;
	RCC -> APB2ENR |= RCC_APB2ENR_TIM1EN;
	//RCC -> APB1ENR |= RCC_APB1ENR_TIM4EN;

	timerSetup();

	GPIOSetup();

	UARTSetup();

	UART2Setup();

	uint16_t A = 0;
	uint16_t B = 0;
	uint16_t count = 0;

	while(1)
	{
		USART1 -> CR1 |= USART_CR1_RE;
		USART2 -> CR1 |= USART_CR1_RE;

		if(count==0)
		{
			emStop();
			A = USART1 -> DR;

			if(A=='u')
				count=1;

			if(A == 'a'|| A=='A')
			{
				stopArm();

				uint32_t x = 0;
				uint32_t y = 0;
				uint32_t x1 = 0;
				uint32_t y1 = 0;
				uint8_t z = 0;
				uint8_t z1 = 0;
				uint8_t w = 0;
				uint8_t w1 = 0;
				uint8_t c1=0;

				for(int i=0;i<4;i++)
				{
					emStop();
					x = USART1 -> DR;
					x = x - 48;
					x1 = x + x1*10;
				}
				//x1 is output

				for(int j=0;j<4;j++)
				{
					emStop();
					y = USART1 -> DR;
					y = y - 48;
					y1 = y + y1*10;
				}
				//y1 is output

				for(int k=0;k<2;k++)
				{
					emStop();
					z = USART1 -> DR;
					z = z - 48;
					z1 = z + z1*10;
				}

				emStop();
				w = USART1 -> DR;
				w = w - 48;
				w1 = w;

				emStop();
				c1 = USART1 -> DR;

				y1 = y1 - 1024;
				z1 = z1 - 13;
				x1 = x1 - 1024;

				if(x1==2047)
					x1=2048;

				if(y1==1)
					y1=0;

				x1 = x1*32;
				y1 = y1*32;

				if(x1==65536)
					x1=65535;

				if(y1==65536)
					y1=65535;

				if(A=='a')
					motorCode(x1, y1, z1, w1, c1);

				else if(A=='A')
					motorCode1(x1, y1, z1, w1, c1);

				x1=0;
				y1=0;
				z1=0;
				w1=0;
				c1=0;
			}

			else if(A=='r')
			{
				TIM3 -> CCR4 = 0;//FL
				TIM3 -> CCR3 = 0;//FR

				emStop();
				A = USART1 -> DR;

				RoboticArm(A);
			}
		}

		if(count==1)
		{
			emStop1();
			B = USART2 -> DR;

			if(B=='u')
				count=0;

			if(B == 'a')
			{
				stopArm();

				uint32_t x = 0;
				uint32_t y = 0;
				uint32_t x1 = 0;
				uint32_t y1 = 0;
				uint8_t z = 0;
				uint8_t z1 = 0;
				uint8_t w = 0;
				uint8_t w1 = 0;
				uint8_t c1=0;

				for(int i=0;i<4;i++)
				{
					emStop1();
					x = USART2 -> DR;
					x = x - 48;
					x1 = x + x1*10;
				}
				//x1 is output

				for(int j=0;j<4;j++)
				{
					emStop1();
					y = USART2 -> DR;
					y = y - 48;
					y1 = y + y1*10;
				}
				//y1 is output

				for(int k=0;k<2;k++)
				{
					emStop1();
					z = USART2 -> DR;
					z = z - 48;
					z1 = z + z1*10;
				}

				emStop1();
				w = USART2 -> DR;
				w = w - 48;
				w1 = w;

				emStop1();
				c1 = USART2 -> DR;

				y1 = y1 - 1024;
				z1 = z1 - 13;
				x1 = x1 - 1024;

				if(x1==2047)
					x1=2048;

				if(y1==1)
					y1=0;

				x1 = x1*32;
				y1 = y1*32;

				if(x1==65536)
					x1=65535;

				if(y1==65536)
					y1=65535;

				if(A=='a')
					motorCode(x1, y1, z1, w1, c1);

				x1=0;
				y1=0;
				z1=0;
				w1=0;
				c1=0;
			}
		}
	}
}
